microdynamics-robot-quadcopter/breeze_firmware_none/System/System_NRF24L01/stm32f10x_system_nrf24l01.h
#ifndef __STM32F10X_SYSTEM_NRF24L01_H__
#define __STM32F10X_SYSTEM_NRF24L01_H__

#include "stm32f10x.h"

//*********************************************NRF24L01*************************************
#define TX_ADR_WIDTH    5   	// 5 uints TX address width
#define RX_ADR_WIDTH    5   	// 5 uints RX address width

#define RX_PLOAD_WIDTH  32  	// 32 uints TX payload
#define TX_PLOAD_WIDTH  32  	// 32 uints TX payload
//***************************************NRF24L01寄存器指令*******************************************************
#define NRF_READ_REG    0x00  	// 读寄存器指令
#define NRF_WRITE_REG   0x20 	// 写寄存器指令
#define RD_RX_PLOAD     0x61  	// 读取接收数据指令
#define WR_TX_PLOAD     0xA0  	// 写待发数据指令
#define FLUSH_TX        0xE1 	// 冲洗发送 FIFO指令
#define FLUSH_RX        0xE2  	// 冲洗接收 FIFO指令
#define REUSE_TX_PL     0xE3  	// 定义重复装载数据指令
#define NOP             0xFF  	// 保留
//*************************************SPI(nRF24L01)寄存器地址****************************************************
#define CONFIG          0x00    // 配置收发状态，CRC校验模式以及收发状态响应方式
#define EN_AA           0x01    // 自动应答功能设置
#define EN_RXADDR       0x02    // 可用信道设置
#define SETUP_AW        0x03    // 收发地址宽度设置
#define SETUP_RETR      0x04    // 自动重发功能设置
#define RF_CH           0x05    // 工作频率设置
#define RF_SETUP        0x06    // 发射速率、功耗功能设置
#define NRFRegSTATUS    0x07    // 状态寄存器
#define OBSERVE_TX      0x08    // 发送监测功能
#define CD              0x09    // 地址检测           
#define RX_ADDR_P0      0x0A    // 频道0接收数据地址
#define RX_ADDR_P1      0x0B    // 频道1接收数据地址
#define RX_ADDR_P2      0x0C    // 频道2接收数据地址
#define RX_ADDR_P3      0x0D    // 频道3接收数据地址
#define RX_ADDR_P4      0x0E    // 频道4接收数据地址
#define RX_ADDR_P5      0x0F    // 频道5接收数据地址
#define TX_ADDR         0x10    // 发送地址寄存器
#define RX_PW_P0        0x11    // 接收频道0接收数据长度
#define RX_PW_P1        0x12    // 接收频道1接收数据长度
#define RX_PW_P2        0x13    // 接收频道2接收数据长度
#define RX_PW_P3        0x14    // 接收频道3接收数据长度
#define RX_PW_P4        0x15    // 接收频道4接收数据长度
#define RX_PW_P5        0x16    // 接收频道5接收数据长度
#define FIFO_STATUS     0x17    // FIFO栈入栈出状态寄存器设置
//**************************************************************************************
#define RX_DR           6		//中断标志
#define TX_DS           5
#define MAX_RT          4

#define MAX_TX  		0x10   //达到最大发送次数中断
#define TX_OK   		0x20   //TX发送完成中断
#define RX_OK   		0x40   //接收到数据中断


extern void NRF24L01_INIT(void);
extern void SetRX_Mode(void);
extern void SetTX_Mode(void);
extern void NRF_TxPacket(uint8_t *tx_buf, uint8_t len);
extern uint8_t NRF_RxPacket(uint8_t *rx_buf, uint8_t len);
extern u8 NRF24L01_RxPacket(u8 *rxbuf);
extern uint8_t NRF_Write_Reg(uint8_t reg, uint8_t value);
extern uint8_t NRF_Write_Buf(uint8_t reg, uint8_t *pBuf, uint8_t len);
extern uint8_t NRF_Read_Reg(uint8_t reg);
extern uint8_t NRF_Read_Buf(uint8_t reg, uint8_t *pBuf, uint8_t len);

extern void NRF_Irq(void);


extern u8 NRF24L01_Check(void);

extern uint8_t NRF24L01_RXDATA[RX_PLOAD_WIDTH];
extern uint8_t NRF24L01_TXDATA[TX_PLOAD_WIDTH];

extern void NRF_Matching(void);
extern void ReceiveDataFromNRF(void);

#endif
